const SCRIPT_URL = "https://script.google.com/macros/s/AKfycbygfN5se3jLUfNQIN5J_9sDTSXkdzAYm7TgyL4g011Or14Nv01KvscZbKnQghdxej6d/exec;
const THEME_KEY = "petroleum_receipt_theme";

const KNOWN_COMPANY_BY_TAX_ID = {
  "0505540004101": "บ. แฝดสาม ศรีจอมทอง จำกัด",
  "0505519000030": "บ.สุขุม เซอร์วิซ จำกัด",
  "0505556006879": "บ. มิตรเกื้อกูล ปิโตเลี่ยม จำกัด",
  "0505538000929": "บ. เพิ่มพูล ปิโตเลี่ยม จำกัด",
  "0503532000151": "หจก.เจริญสุข เซอร์วิซ",
  "0505532001079": "บ. เทพไชยา จำกัด",
  "0505563012056": "บ.นพรัตน์ ปิโตเลี่ยม เชียงใหม่ จำกัด",
  "0505540000400": "บ.อินทนนท์ ธนโชติ จำกัด",
  "0503525000222": "หจก.พนาพนธ์เชียงใหม่",
  "0625551000057": "บริษัท ธรรมรัตน์ ปิโตรเลียม จำกัด",
  "0623539000849": "หจก.โค้งวิไลไทยเสรี",
  "0623556001211": "หจก. สลกบาตร 2556",
  "0105537121254": "บริษัท ปตท.บริหารธุรกิจค้าปลีก จำกัด",
  "0105555115341": "บริษัท ส.รุ่งวิภา จำกัด",
  "0515553000471": "บริษัท ลำพูน ปิโตรเลียม จำกัด",
  "0663538000209": "ปตท.นพพรออยล์",
  "0655557000245": "บริษัท พี เอ เอ็ม เอนเนอร์จี จำกัด",
  "0673556000908": "ห้างหุ้นส่วนจำกัด มิตรศิลป์บริการ",
  "0573529000243": "ห้างหุ้นส่วนจำกัด แม่สรวยปิโตรเลียม",
  "0525555000613": "บริษัท ภัตรานครเขลางค์ จำกัด"
};
